Djspaceg/esp32-display/firmware/libraries/espdisp_board/src/board_config.h
// Which supported board this binary is running on, and every board fact that
// follows from that.
//
// Eleven board profiles are supported across the c3, c6, s3, and p4 release
// families. Each family has one artifact; runtime profile selection keeps the
// physical panel/controller token independent from that family identity:
//
//   ESP32-C6-LCD-1.47          ST7789 172x320 over SPI, addressable RGB LED on
//                              GPIO8, BOOT on GPIO9
//   ESP32-C6-Touch-LCD-1.47    JD9853 172x320 over SPI, no addressable LED,
//                              BOOT on GPIO9, AXS5106L touch + QMI8658A IMU on
//                              I2C GPIO18/19, battery voltage on ADC GPIO0
//   ESP32-S3-Touch-AMOLED-1.75C  CO5300 466x466 AMOLED over QSPI, CST9217
//                              touch on I2C GPIO15/14, AXP2101 PMU, QMI8658
//                              IMU
//   ESP32-S3-LCD-0.85          GC9107 128x128 over SPI, BOOT on GPIO0,
//                              battery ADC and eight addressable RGB LEDs
//   ESP32-S3-LCD-1.3           ST7789V2 240x240 over SPI, QMI8658A IMU on
//                              I2C GPIO47/48, battery ADC and one RGB LED
//   ESP32-S3-LCD-1.9           ST7789V2 170x320 over SPI, QMI8658 IMU on
//                              I2C GPIO47/48, two GRB LEDs, active-low
//                              backlight
//   ESP32-S3-Touch-LCD-1.54    ST7789 240x240 over SPI, CST816 touch and
//                              QMI8658 IMU on I2C GPIO42/41, battery ADC
//   ESP32-S3-Touch-LCD-1.85C   ST77916 360x360 LCD over QSPI, CST816 touch
//                              on I2C GPIO11/10, reset through TCA9554
//   CrowPanel 1.28 Rotary Knob GC9A01 240x240 round LCD over SPI, CST816D
//                              touch on I2C GPIO6/7, rotary encoder on
//                              GPIO45/42 and knob press on GPIO41
//
// The C6 and S3 families choose a profile before any panel GPIO is driven,
// except that the CrowPanel knob probe pulses that board's panel supply rail
// (GPIO1), and only when no earlier S3 probe has answered.
// C6 distinguishes its two profiles on one shared I2C bus. S3 first uses the
// 8 MiB flash identity for GC9107, then probes profile-specific I2C buses on
// larger-flash hardware and accepts a result only when exactly one profile
// matches. P4 currently has one supported carrier but retains the same
// platform/panel/carrier separation internally.
//
// Resolution is a panel-profile fact. The sketch derives frame geometry from
// the Config's composed PanelConfig instead of a project-wide constant.
//
// This header is deliberately hardware-free (pure data plus arithmetic) so it
// is unit tested on the host alongside band_protocol.h and panel_state.h. The
// board_detect.h executes the generated electrical plan because it needs Wire.
#pragma once

#include <stdint.h>
#include <string.h>

#include "audio_config.h"
#include "board_detection.h"
#include "panel_config.h"
#include "platform_config.h"

namespace board {

/// Sentinel for "this board does not have that pin at all".
static const int8_t NO_PIN = -1;

/// The supported boards.
///
/// Unknown is the pre-detection state and the result of parsing a stored value
/// that no longer maps to a variant. It is never a usable configuration - see
/// resolve().
#include "generated_board_variants.h"
#include "generated_board_identity.h"
#include "generated_board_audio.h"
#include "generated_board_detection.h"

/// Which capacitive touch controller the board carries, so the sketch knows
/// which register protocol to speak. The pins alone cannot tell these apart.
enum class TouchController : uint8_t { None, Axs5106l, Cst9217, Cst816, Gt911 };

/// How battery telemetry is obtained. The S3's AXP2101 reports voltage,
/// percentage, external power, and charge state. The C6 touch board exposes
/// only a 3:1 battery-voltage divider on GPIO0; it can estimate percentage but
/// cannot observe the ETA6098 charger's STAT output, so charge state remains
/// explicitly unknown.
enum class PowerController : uint8_t { None, Axp2101, BatteryAdc };

/// Which inertial sensor supplies acceleration for automatic orientation.
enum class MotionController : uint8_t { None, Qmi8658 };

/// The variant fixed by an exact build target before runtime detection.
/// C6 and S3 are family-universal, so both remain Unknown until their safe
/// profile detector or an explicit CFGBOARD recovery override resolves one.
/// The p4-4b build target composes the P4 platform with one exact carrier;
/// platform_config.h remains free of that carrier's selector and wiring.
#if defined(CONFIG_IDF_TARGET_ESP32P4)
#if (defined(ESPDISP_BOARD_P4_4B) + defined(ESPDISP_BOARD_S3_085) + \
     defined(ESPDISP_BOARD_S3_154) + defined(ESPDISP_DOOM_S3_175) + \
     defined(ESPDISP_BOARD_S3_185)) != 1
#error "ESP32-P4 builds require exactly one compatible internal carrier selector"
#endif
#if defined(ESPDISP_DOOM_RUNTIME) && !defined(ESPDISP_BOARD_P4_4B)
#error "ESP32-P4 Doom runtime requires the board-neutral P4 carrier selector"
#endif
#if defined(ESPDISP_BOARD_P4_4B)
#include "generated_p4_compile.h"
#else
#error "The selected carrier is not compatible with ESP32-P4"
#endif
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(ESPDISP_BOARD_P4_4B) || defined(ESPDISP_BOARD_S3_085) || \
    defined(ESPDISP_BOARD_S3_154) || defined(ESPDISP_DOOM_S3_175) || \
    defined(ESPDISP_BOARD_S3_185)
#error "ESP32-S3 family builds must not use profile-specific compile selectors"
#endif
#define ESPDISP_PANEL_S3_RUNTIME 1
static const Variant COMPILED_VARIANT = Variant::Unknown;
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#if defined(ESPDISP_BOARD_P4_4B) || defined(ESPDISP_BOARD_S3_085) || \
    defined(ESPDISP_BOARD_S3_154) || defined(ESPDISP_DOOM_S3_175) || \
    defined(ESPDISP_BOARD_S3_185) || defined(ESPDISP_DOOM_RUNTIME)
#error "ESP32-C3 family builds must not use selectors from another family"
#endif
#define ESPDISP_PANEL_C3_RUNTIME 1
static const Variant COMPILED_VARIANT = Variant::Unknown;
#else
#if defined(ESPDISP_BOARD_P4_4B) || defined(ESPDISP_BOARD_S3_085) || \
    defined(ESPDISP_BOARD_S3_154) || defined(ESPDISP_DOOM_S3_175) || \
    defined(ESPDISP_BOARD_S3_185) || defined(ESPDISP_DOOM_RUNTIME)
#error "ESP32-C6 family builds must not use selectors from another family"
#endif
#define ESPDISP_PANEL_C6_RUNTIME 1
static const Variant COMPILED_VARIANT = Variant::Unknown;
#endif

/// The shared I2C bus that C6 boot-time detection probes. Same pins on both
/// C6 boards; only the Touch variant has anything answering on it. Meaningless
/// on the S3, whose generated plan uses four different buses.
static const int8_t PIN_PROBE_SDA = GENERATED_C6_PROBES[0].sda;
static const int8_t PIN_PROBE_SCL = GENERATED_C6_PROBES[0].scl;
/// Touch controller reset, as used by *detection*, which necessarily runs before
/// the variant is known and so cannot read it out of the table below. Released
/// before probing so a touch chip held in reset cannot make a Touch board look
/// like a non-touch one. Must equal CONFIG_TOUCH_JD9853.pinTouchRst.
static const int8_t PIN_PROBE_TP_RST = GENERATED_C6_PROBES[0].resetPin;

/// Whether a platform can execute a panel profile. SPI/QSPI panel backends are
/// platform-neutral; the MIPI-DSI SDK backend is currently available on P4.
/// Carrier pins are deliberately absent from this decision.
constexpr bool platformSupportsPanel(const PlatformConfig &platform,
                                     const PanelConfig &panel) {
  return panel.bus != PanelBus::MipiDsi ||
         platform.platform == Platform::Esp32P4;
}

