Djspaceg/esp32-display/firmware/libraries/espdisp_board/src/board_config.h
/// The carrier composition consumed after detection. Controller implementations
/// may still branch on capabilities, but board facts belong in descriptor-backed
/// rows rather than scattered profile tests.
struct Config {
  Variant variant;
  const char *name;
  /// Orthogonal composition axes. Platform contains chip/runtime facts only;
  /// panel contains controller/interface/timing facts only; the remaining
  /// fields are carrier wiring and peripherals.
  const PlatformConfig *platform;
  const PanelConfig *panel;

  // Panel controller, interface, geometry, timing, offsets, inversion and
  // shape are read only through `panel`. This carrier owns wiring and mated
  // peripherals; keeping panel facts out of it makes composition executable
  // rather than two tables that can drift.

  // Panel bus + control pins. pinMosi is the single data line on SPI boards
  // and data lane 0 on QSPI boards - the same physical role, and the same
  // union field in the IDF's spi_bus_config_t. Lanes 1-3 are NO_PIN on SPI
  // boards. pinDc is NO_PIN on QSPI panels: the command envelope replaces the
  // D/C line.
  int8_t pinSclk;
  int8_t pinMosi;   // data0 on QSPI
  int8_t pinData1;
  int8_t pinData2;
  int8_t pinData3;
  int8_t pinCs;
  int8_t pinDc;
  int8_t pinRst;

  /// PWM backlight, or NO_PIN. AMOLEDs have no backlight at all - each pixel
  /// emits - so brightness there is panel command 0x51, not a PWM duty. The
  /// sketch picks its brightness sink from hasBacklightPin().
  int8_t pinBl;

  // BOOT button: short press toggles backlight, long press flips 180.
  //
  // GPIO9 on both C6 boards. Waveshare's pinout table for the Touch board says
  // GPIO8 and omits GPIO9 entirely; that is wrong. Measured on a real board by
  // holding both pins INPUT_PULLUP and watching which one moves: every press
  // pulls GPIO9 low, GPIO8 never changes and reads high at rest. Trusting the
  // table shipped a firmware whose button silently did nothing on this variant.
  //
  // GPIO0 on the S3 board is the chip's standard BOOT strapping pin and what
  // Waveshare's docs describe. Confirmed on real hardware: all three press
  // tiers (short/long/extra-long, see handleButton() in display_stream.ino)
  // fired correctly in one continuous press-and-release, watched live over
  // serial. The C6 history above is why that check mattered rather than
  // trusting the table outright.
  int8_t pinBootButton;

  // Addressable WS2812-style LED, or NO_PIN. Present only on the C6 non-touch
  // board; the Touch board has none, so nothing should ever drive GPIO8 there.
  // Its function on the Touch board is undocumented and unmeasured - it reads
  // high with a pull-up and is not the button - which is reason enough to leave
  // it alone rather than assume it is spare.
  int8_t pinRgbLed;

  // Capacitive touch: which controller, its I2C bus, and its reset/interrupt
  // lines (NO_PIN when absent). Gated because pinTouchInt is GPIO21 on the C6
  // Touch board while GPIO21 is LCD_RST on the non-touch one: enabling touch
  // unconditionally would attach an interrupt to the other board's panel reset
  // line, and pulse GPIO20 there for no reason.
  //
  // Reset topology is profile-specific. Touch bring-up compares these fields:
  // it never re-pulses a line shared with the panel, but it must pulse a
  // dedicated GPIO or expander output before the first I2C command.
  TouchController touch;
  int8_t pinTouchSda;
  int8_t pinTouchScl;
  int8_t pinTouchRst;
  int8_t pinTouchInt;

  /// Battery telemetry source. AXP2101 shares the touch I2C bus; BatteryAdc
  /// uses pinBatteryAdc and batteryAdcScale to reconstruct cell millivolts from
  /// the board's resistor divider. pinBatteryEnable and pinChargeStatus are
  /// optional carrier controls for ADC paths; charge status is active-low.
  PowerController power;
  int8_t pinBatteryAdc;
  uint8_t batteryAdcScale;
  int8_t pinBatteryEnable;
  int8_t pinChargeStatus;

  /// QMI8658-family accelerometer on the shared touch I2C bus. The axis fields
  /// map sensor X/Y/Z indices onto panel-right and panel-down coordinates. Both
  /// vendor board examples use the identity map; keeping it in the table makes
  /// a board-revision correction local rather than baking it into the classifier.
  MotionController motion;
  uint8_t motionXAxis;
  int8_t motionXSign;
  uint8_t motionYAxis;
  int8_t motionYSign;

  /// Reset lines provided by a TCA9554 at address 0x20. Zero means the reset
  /// is a direct GPIO (`pinRst` / `pinTouchRst`) or absent. EXIO is 1..8.
  uint8_t panelResetExio;
  uint8_t touchResetExio;

  /// Optional carrier-level backlight enable and PWM polarity. These stay in
  /// the carrier composition because they are wiring, not panel or P4 facts.
  int8_t pinBlEnable;
  bool backlightInverted;

  /// Optional UART bridge connected to this carrier's external USB port.
  /// When absent, the platform's serial transport remains authoritative.
  int8_t pinSerialRx = NO_PIN;
  int8_t pinSerialTx = NO_PIN;

  /// Optional GPIO that switches the panel's own supply rail. Panel bring-up
  /// drives it high before the bus starts and holds it there (boot detection
  /// may pulse it earlier). On the CrowPanel knob it also feeds the backlight
  /// anode and the touch pull-ups.
  int8_t pinPanelPower = NO_PIN;

  /// Optional quadrature rotary encoder, both lines idle-high. Its push switch,
  /// when it has one, is the carrier's pinBootButton.
  int8_t pinEncoderA = NO_PIN;
  int8_t pinEncoderB = NO_PIN;

  /// Addressable LED byte order: GRB for WS2812B parts driven that way by the
  /// vendor, otherwise the RGB order measured on the C6.
  bool rgbLedGrb = false;

  SerialTransport serialTransport() const {
    return pinSerialRx != NO_PIN && pinSerialTx != NO_PIN
               ? SerialTransport::UartBridge
               : platform->serial;
  }

  bool hasRgbLed() const { return pinRgbLed != NO_PIN; }
  bool hasBootButton() const { return pinBootButton != NO_PIN; }
  bool hasEncoder() const {
    return pinEncoderA != NO_PIN && pinEncoderB != NO_PIN;
  }
  bool hasTouch() const {
    if (touch == TouchController::None || pinTouchSda == NO_PIN ||
        pinTouchScl == NO_PIN) {
      return false;
    }
    if (touch == TouchController::Gt911) return true;  // polling profile
    return (pinTouchRst != NO_PIN || touchResetExio != 0) &&
           pinTouchInt != NO_PIN;
  }
  /// Whether a battery reading is possible at all on this board. The bus pins
  /// are part of the test because the PMU is read over the touch I2C bus: a
  /// controller with nowhere to talk cannot be read, and claiming otherwise
  /// would make the firmware advertise a battery it can never sample.
  bool hasBattery() const {
    if (power == PowerController::Axp2101) {
      return pinTouchSda != NO_PIN && pinTouchScl != NO_PIN;
    }
    if (power == PowerController::BatteryAdc) {
      return pinBatteryAdc != NO_PIN && batteryAdcScale > 0;
    }
    return false;
  }
  bool hasMotion() const {
    return motion != MotionController::None && pinTouchSda != NO_PIN &&
           pinTouchScl != NO_PIN && motionXAxis < 3 && motionYAxis < 3 &&
           motionXAxis != motionYAxis &&
           (motionXSign == 1 || motionXSign == -1) &&
           (motionYSign == 1 || motionYSign == -1);
  }
  bool isQspi() const {
    return panel != nullptr && panel->bus == PanelBus::Qspi;
  }
  bool isDsi() const {
    return panel != nullptr && panel->bus == PanelBus::MipiDsi;
  }
  bool hasExpanderReset() const {
    return panelResetExio != 0 || touchResetExio != 0;
  }
  /// Brightness sink: PWM duty on this pin, or panel command 0x51 when absent.
  bool hasBacklightPin() const { return pinBl != NO_PIN; }
};

#include "generated_board_configs.h"

/// ESP32-C6-LCD-1.47: ST7789, addressable LED, BOOT on GPIO9.
static const Config CONFIG_LCD_ST7789 = {
    Variant::LcdSt7789,
    "ESP32-C6-LCD-1.47 (ST7789)",
    &PLATFORM_ESP32_C6,
    &PANEL_ST7789_172X320,
    /* sclk  */ 7,
    /* mosi  */ 6,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 14,
    /* dc    */ 15,
    /* rst   */ 21,
    /* bl    */ 22,
    /* boot  */ 9,
    /* led   */ 8,
    TouchController::None,
    /* touchSda */ NO_PIN,  // I2C pins exist on the board but carry nothing
    /* touchScl */ NO_PIN,
    /* touchRst */ NO_PIN,
    /* touchInt */ NO_PIN,
    PowerController::None,
    /* batteryAdc */ NO_PIN,
    /* adcScale */ 0,
    /* batteryEnable */ NO_PIN,
    /* chargeStatus */ NO_PIN,
    MotionController::None,
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
};

/// ESP32-S3-Touch-LCD-1.85C: ST77916 360x360 round TFT over QSPI.
/// Panel and CST816 touch reset are TCA9554 EXIO2 and EXIO1 respectively.
static const Config CONFIG_LCD_ST77916 = {
    Variant::LcdSt77916,
    "ESP32-S3-Touch-LCD-1.85C (ST77916)",
    &PLATFORM_ESP32_S3,
    &PANEL_ST77916_360X360,
    /* sclk  */ 40,
    /* mosi  */ 46,
    /* data1 */ 45,
    /* data2 */ 42,
    /* data3 */ 41,
    /* cs    */ 21,
    /* dc    */ NO_PIN,
    /* rst   */ NO_PIN,
    /* bl    */ 5,
    /* boot  */ 0,
    /* led   */ NO_PIN,
    TouchController::Cst816,
    /* touchSda */ 11,
    /* touchScl */ 10,
    /* touchRst */ NO_PIN,
    /* touchInt */ 4,
    // GPIO8 is the battery sense, through the same 3:1 divider the other
    // divider boards use. Confirmed on attached hardware at 3750 mV / 35
    // percent. The divider intermittently returns 0, and an earlier session
    // sampled a run of those zeros, concluded the pin was dead and reverted
    // this declaration; batteryestimate::selectCellMillivolts is what makes
    // them harmless, by taking the median of the samples that could physically
    // be a cell. GPIO8 is ADC1_CH7, the WiFi-safe ADC unit, and is otherwise
    // unused in this pin map, so the zeros are a property of the divider rather
    // than of the assignment.
    //
    // No enable line and no charge-status net exist on this design, so charge
    // state stays honestly unknown - the same posture the C6 takes.
    PowerController::BatteryAdc,
    /* batteryAdc */ 8,
    /* adcScale */ 3,
    /* batteryEnable */ NO_PIN,
    /* chargeStatus */ NO_PIN,
    MotionController::None,
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 2,
    /* touchResetExio */ 1,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
};

/// ESP32-S3-LCD-0.85: GC9107 128x128 square LCD over 4-wire SPI.
/// PLUS (GPIO4) and PWR (GPIO5) are carrier controls with no stream-firmware
/// action; only BOOT GPIO0 is mapped to the established button behavior.
static const Config CONFIG_LCD_GC9107 = {
    Variant::LcdGc9107,
    "ESP32-S3-LCD-0.85 (GC9107)",
    &PLATFORM_ESP32_S3,
    &PANEL_GC9107_128X128,
    /* sclk  */ 38,
    /* mosi  */ 39,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 21,
    /* dc    */ 45,
    /* rst   */ 40,
    /* bl    */ 46,
    /* boot  */ 0,
    /* led   */ 48,
    TouchController::None,
    /* touchSda */ NO_PIN,
    /* touchScl */ NO_PIN,
    /* touchRst */ NO_PIN,
    /* touchInt */ NO_PIN,
    PowerController::BatteryAdc,
    /* batteryAdc */ 1,
    /* adcScale */ 3,
    /* batteryEnable */ 2,
    /* chargeStatus */ 3,
    MotionController::None,
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
};

/// ESP32-S3-Touch-LCD-1.54: 240x240 ST7789 over 4-wire SPI, with a
/// directly-reset CST816 touch controller and QMI8658 on I2C GPIO42/41.
/// GPIO4/GPIO5 are auxiliary carrier buttons; only BOOT GPIO0 is assigned an
/// established stream-firmware action.
static const Config CONFIG_TOUCH_ST7789 = {
    Variant::TouchSt7789,
    "ESP32-S3-Touch-LCD-1.54 (ST7789)",
    &PLATFORM_ESP32_S3,
    &PANEL_ST7789_240X240,
    /* sclk  */ 38,
    /* mosi  */ 39,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 21,
    /* dc    */ 45,
    /* rst   */ 40,
    /* bl    */ 46,
    /* boot  */ 0,
    /* led   */ NO_PIN,
    TouchController::Cst816,
    /* touchSda */ 42,
    /* touchScl */ 41,
    /* touchRst */ 47,
    /* touchInt */ 48,
    PowerController::BatteryAdc,
    /* batteryAdc */ 1,
    /* adcScale */ 3,
    /* batteryEnable */ 2,
    /* chargeStatus */ 3,
    MotionController::Qmi8658,
    // Waveshare's QMI8658 example exposes the sensor axes without remapping.
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
};

/// Waveshare ESP32-S3-LCD-1.3: 240x240 ST7789V2 over 4-wire SPI,
/// QMI8658A on I2C GPIO47/48, a 2:1 battery divider on GPIO7, and one
/// WS2812-compatible RGB LED on GPIO19. The schematic routes backlight PWM to
/// GPIO20; Waveshare's Arduino demo confirms mode 0, 40 MHz, RGB order,
/// inversion, and zero display offsets. The standard, case, and prism versions
/// share this carrier; square-panel software rotation covers the prism mount.
static const Config CONFIG_LCD_ST7789_130 = {
    Variant::LcdSt7789_130,
    "ESP32-S3-LCD-1.3 (ST7789V2)",
    &PLATFORM_ESP32_S3,
    &PANEL_ST7789V2_240X240,
    /* sclk  */ 40,
    /* mosi  */ 41,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 39,
    /* dc    */ 38,
    /* rst   */ 42,
    /* bl    */ 20,
    /* boot  */ NO_PIN,
    /* led   */ 19,
    TouchController::None,
    /* touchSda */ 47,  // shared QMI8658A bus; this board has no touch
    /* touchScl */ 48,
    /* touchRst */ NO_PIN,
    /* touchInt */ NO_PIN,
    PowerController::BatteryAdc,
    /* batteryAdc */ 7,
    /* adcScale */ 2,
    /* batteryEnable */ NO_PIN,
    /* chargeStatus */ NO_PIN,
    MotionController::Qmi8658,
    // Waveshare's examples consume the QMI8658 axes without remapping.
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
    /* serialRx */ 44,
    /* serialTx */ 43,
};

/// Waveshare ESP32-S3-LCD-1.9: 170x320 ST7789V2 over 4-wire SPI (column
/// offset 35 in a 240x320 controller), QMI8658 on I2C GPIO47/48, BOOT on
/// GPIO0, two WS2812B on GPIO15, native USB-Serial-JTAG on GPIO19/20. The
/// backlight is an AO3401 P-FET, so GPIO14 is active low. GPIO4 senses the
/// system rail through a 200k/100k divider: it reads VSYS/3 on USB and on
/// battery alike, which makes it the detection guard that keeps this carrier
/// apart from the 1.3-inch one, and not a battery gauge. Pins and init facts
/// are from Waveshare's schematic and ESP-IDF factory demo.
static const Config CONFIG_LCD_ST7789_190 = {
    Variant::LcdSt7789_190,
    "ESP32-S3-LCD-1.9 (ST7789V2)",
    &PLATFORM_ESP32_S3,
    &PANEL_ST7789V2_170X320,
    /* sclk  */ 10,
    /* mosi  */ 13,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 12,
    /* dc    */ 11,
    /* rst   */ 9,
    /* bl    */ 14,
    /* boot  */ 0,
    /* led   */ 15,
    TouchController::None,
    /* touchSda */ 47,  // shared QMI8658 bus; the non-touch SKU has no touch
    /* touchScl */ 48,
    /* touchRst */ NO_PIN,
    /* touchInt */ NO_PIN,
    // No battery telemetry: the GPIO4 divider sits on the system rail, which
    // is VBUS through a diode on USB, so it would report a full cell whenever
    // the board is plugged in, battery or not.
    PowerController::None,
    /* batteryAdc */ NO_PIN,
    /* adcScale */ 0,
    /* batteryEnable */ NO_PIN,
    /* chargeStatus */ NO_PIN,
    MotionController::Qmi8658,
    // Waveshare's QMI8658 example consumes the sensor axes without remapping.
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ true,
    /* serialRx */ NO_PIN,
    /* serialTx */ NO_PIN,
    /* panelPower */ NO_PIN,
    /* encoderA */ NO_PIN,
    /* encoderB */ NO_PIN,
    // Waveshare's ESP-IDF and Arduino WS2812 demos both drive these as GRB.
    /* rgbLedGrb */ true,
};

