Djspaceg/esp32-display/firmware/libraries/espdisp_board/src/board_config.h
/// ELECROW CrowPanel 1.28" rotary display: GC9A01 240x240 round IPS over
/// 4-wire SPI, CST816D touch on GPIO6/7, and a detented EC3501 encoder whose
/// push switch (GPIO41, active low) takes the BOOT-button actions. GPIO1 powers
/// the LCD-3.3 rail - panel, backlight anode and touch pull-ups - so nothing on
/// the glass works until it is high. Nets are from ELECROW's schematic; the
/// vendor factory sketch confirms the same pins and SPI mode 0 with inversion.
/// The five-LED WS2812 ring (GPIO48) and green power LED (GPIO40) are left
/// undriven.
static const Config CONFIG_ELECROW_KNOB_128 = {
    Variant::ElecrowKnob128,
    "CrowPanel 1.28 Rotary Knob (GC9A01)",
    &PLATFORM_ESP32_S3,
    &PANEL_GC9107_240X240,
    /* sclk  */ 10,
    /* mosi  */ 11,
    /* data1 */ NO_PIN,
    /* data2 */ NO_PIN,
    /* data3 */ NO_PIN,
    /* cs    */ 9,
    /* dc    */ 3,
    /* rst   */ 14,
    /* bl    */ 46,
    /* boot  */ 41,  // knob push switch; the chip BOOT key GPIO0 is unused
    /* led   */ NO_PIN,
    TouchController::Cst816,
    /* touchSda */ 6,
    /* touchScl */ 7,
    /* touchRst */ 13,
    /* touchInt */ 5,
    PowerController::None,
    /* batteryAdc */ NO_PIN,
    /* adcScale */ 0,
    /* batteryEnable */ NO_PIN,
    /* chargeStatus */ NO_PIN,
    MotionController::None,
    /* motion X */ 0, 1,
    /* motion Y */ 1, 1,
    /* panelResetExio */ 0,
    /* touchResetExio */ 0,
    /* pinBlEnable */ NO_PIN,
    /* backlightInverted */ false,
    /* serialRx */ NO_PIN,
    /* serialTx */ NO_PIN,
    /* panelPower */ 1,
    /* encoderA */ 45,
    /* encoderB */ 42,
};

#include "generated_board_config_lookup.h"

/// Whether a physical profile belongs to a platform family. This is used both
/// for CFGBOARD recovery overrides and for detection results, so neither path
/// can make a family artifact drive another chip family's pin map.
inline bool variantMatchesPlatform(Variant variant, Platform platform) {
  const GeneratedBoardIdentity *identity = generatedIdentity(variant);
  return identity != nullptr && identity->platform == platform;
}

struct DetectionResult {
  Variant variant;
  uint8_t matchedCandidates;
};

inline DetectionResult detectFromEvidence(
    Platform platform, uint32_t flashBytes,
    const boarddetectmodel::ProbeEvidence *evidence, size_t evidenceCount,
    const boarddetectmodel::SenseEvidence *senses = nullptr,
    size_t senseCount = 0) {
  const boarddetectmodel::Evaluation result = boarddetectmodel::evaluate(
      detectionPlanForPlatform(platform), flashBytes, evidence, evidenceCount,
      senses, senseCount);
  return {(Variant)result.variantValue, result.matchedCandidates};
}

/// Resolve the S3 detector's independent profile signals. The 8 MiB carrier is
/// identified by flash capacity; each larger-flash profile has a distinct I2C
/// bus, except that the 1.3-inch and 1.9-inch carriers share GPIO47/48 and are
/// separated by the GPIO4 sense: the 1.9's system-rail divider versus the
/// 1.3's bare header pin. A negative gpio4Millivolts means no reading. Exactly
/// one candidate is required. No match and conflicting matches both remain
/// Unknown so setup can stay serial-only until CFGBOARD supplies an explicit
/// recovery override.
inline Variant variantFromS3Probe(uint32_t flashBytes, bool co5300Bus,
                                  bool st77916Bus, bool st7789Bus,
                                  bool qmi8658Bus47_48,
                                  bool knob128Bus = false,
                                  int gpio4Millivolts = -1) {
  const boarddetectmodel::ProbeEvidence evidence[] = {
      {boarddetectmodel::ProbeStatus::Started, (uint8_t)(co5300Bus ? 1 : 0)},
      {boarddetectmodel::ProbeStatus::Started, (uint8_t)(st77916Bus ? 1 : 0)},
      {boarddetectmodel::ProbeStatus::Started, (uint8_t)(st7789Bus ? 1 : 0)},
      {boarddetectmodel::ProbeStatus::Started,
       (uint8_t)(qmi8658Bus47_48 ? 1 : 0)},
      {boarddetectmodel::ProbeStatus::Started, (uint8_t)(knob128Bus ? 1 : 0)},
  };
  const boarddetectmodel::SenseEvidence sense = {
      gpio4Millivolts >= 0,
      (uint16_t)(gpio4Millivolts < 0 ? 0 : gpio4Millivolts)};
  return detectFromEvidence(
             Platform::Esp32S3, flashBytes, evidence,
             sizeof(evidence) / sizeof(evidence[0]), &sense, 1)
      .variant;
}

/// Map a possibly-Unknown C6 variant onto the electrically safer C6 profile.
///
/// Unknown resolves to the C6 Touch board on purpose; it can only arise on the
/// C6 when this fallback is used; unresolved S3 detection is handled as
/// serial-only recovery before configFor(). Both C6 misdetections leave the
/// panel dark, because the SPI pins differ - but they are not equally
/// clean electrically:
///
///   Touch board treated as non-touch  -> SPI clock and data land on GPIO7 and
///       GPIO6, and panel reset on GPIO21. On that board GPIO6 is the QMI8658A
///       interrupt 2 and GPIO21 is the AXS5106L touch interrupt: both are chip
///       *outputs*, so the ESP32 would be driving against two live drivers. It
///       would also PWM GPIO22, which is that board's panel reset. GPIO8 would
///       be driven as a LED output despite having no LED and no known function.
///   Non-touch board treated as Touch  -> SPI lands on GPIO1/GPIO2 and reset on
///       GPIO22, none of which is a known output on that board, and touch setup
///       pulses GPIO20 and reads GPIO21. Pins of unknown function, but nothing
///       confirmed to be driven from the other end.
///
/// Only one of those directions is known to fight two chip outputs, so an
/// inconclusive probe lands on Touch. Note this inverts the historical default
/// of this firmware, and that the original justification for it was stronger
/// than the facts: it assumed Waveshare's claim that GPIO8 is the Touch board's
/// BOOT button, which measurement disproved. The conclusion survives the
/// correction; the reasoning had to be rewritten.
inline Variant resolve(Variant variant) {
  return variant == Variant::Unknown ? Variant::TouchJd9853 : variant;
}

/// The board table for a variant. Unknown resolves per resolve().
inline const Config &configFor(Variant variant) {
  const Config *config = generatedConfigFor(resolve(variant));
  return config == nullptr ? CONFIG_TOUCH_JD9853 : *config;
}

/// Decide the C6 variant from an I2C scan of PIN_PROBE_SDA/SCL.
///
/// The Touch board carries an AXS5106L touch controller and a QMI8658A IMU on
/// that bus (observed at 0x63 and 0x6B); the non-touch board has nothing there.
/// So "anything answered" is the discriminator.
///
/// Only meaningful when COMPILED_VARIANT is Unknown (the C6 build). The S3
/// board also has I2C devices, but its variant never reaches this decision.
///
/// probeSucceeded is whether the scan itself ran meaningfully. A bus that could
/// not be driven tells us nothing about which board this is, and per resolve()
/// "nothing known" must mean Touch.
inline Variant variantFromI2cProbe(bool probeSucceeded, int deviceCount) {
  const boarddetectmodel::ProbeEvidence evidence = {
      probeSucceeded ? boarddetectmodel::ProbeStatus::Started
                     : boarddetectmodel::ProbeStatus::StartFailed,
      (uint8_t)(deviceCount > 255 ? 255 : (deviceCount < 0 ? 0 : deviceCount)),
  };
  return detectFromEvidence(
             Platform::Esp32C6, 8u * 1024u * 1024u, &evidence, 1)
      .variant;
}

/// Parse a variant previously cached in NVS.
///
/// Returns Unknown for anything unrecognised (never written, or written by a
/// future firmware with more variants) so the caller re-probes instead of
/// trusting a value it cannot interpret.
inline Variant variantFromStored(uint8_t raw) {
  const Variant variant = (Variant)raw;
  return generatedIdentity(variant) == nullptr ? Variant::Unknown : variant;
}

/// Parse an operator override (CFGBOARD over USB serial).
///
/// Exact tokens only. "auto" - and anything unrecognised - maps to Unknown,
/// which is the caller's cue to clear the cache and re-probe rather than pin
/// the board to a guess.
inline Variant variantFromName(const char *token) {
  if (token == nullptr) return Variant::Unknown;
  for (const auto &identity : GENERATED_BOARD_IDENTITIES) {
    if (strcmp(token, identity.profile) == 0) return identity.variant;
  }
  return Variant::Unknown;
}

/// Short stable token for a variant, for CFGSHOW/telemetry and NVS debugging.
inline const char *variantToken(Variant variant) {
  const GeneratedBoardIdentity *identity = generatedIdentity(variant);
  return identity == nullptr ? "auto" : identity->profile;
}

/// Stable user-facing firmware family, distinct from the physical profile.
inline const char *targetToken(Variant variant) {
  const GeneratedBoardIdentity *identity = generatedIdentity(variant);
  return identity == nullptr ? "unknown" : identity->target;
}

}  // namespace board
